app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
      id = params['id']
      @movie = Movie.find id

INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Harry Potter"], ["description", "it's a kinf of magic !"], ["release_date", 1999-03-26 00:00:00 UTC], ["created_at", 2017-01-26 22:58:31 UTC], ["updated_at", 2017-01-26 22:58:31 UTC]]
---
  def create
      @movie = Movie.new(movie_params)

      if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 def edit

   id = params['id']
   @movie = Movie.find(id)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "description" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Alladin"], ["description", "Alladin movie"], ["release_date", 1992-11-25 00:00:00 UTC], ["updated_at", 2017-01-26 23:19:35 UTC], ["id", 2]]
---
 def update
    id = params['id']
    @movie = Movie.find(id)
    @movie.update(movie_params)